// Завдання 4: Обчислення площі та об'єму
/*
Завдання 4.1
π - число “пі”. Ви можете використати Math.PI у вашому дз для вираження цього числа:
1. Створіть змінну radius і присвойте їй числове значення радіуса кола.
2. Обчисліть площу кола за формулою π * radius^2 і виведіть результат.
*/

let radius = 10;
let circleArea = Math.PI * Math.pow(radius, 2);

console.log(circleArea.toFixed(2));

/*
Завдання 4.2
1. Створіть змінну length і присвойте їй числове значення довжини прямокутника.
2. Створіть змінну width і присвойте їй числове значення ширини прямокутника.
3.Обчисліть площу прямокутника за формулою length * width і виведіть результат.
*/

let length = 10;
let width = 5;

let areaRectangle = length * width;

console.log(areaRectangle);

/*
Завдання 4.3
1. Створіть змінну radius і присвойте їй числове значення радіуса циліндра.
2. Створіть змінну height і присвойте їй числове значення висоти циліндра.
3. Обчисліть об'єм циліндра за формулою π * radius^2 * height і виведіть результат.
Округліть кожне отримане значення до 2 значень після крапки
*/

let cylinderRadius = 8;
let height = 15;

let volumeCylinder = Math.PI * Math.pow(cylinderRadius, 2) * height;

console.log(volumeCylinder.toFixed(2));
